---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RevisionFailures.RevisionSettingsDuplicateName
source: html/22e26ddf-9d23-7cfb-3a0c-079fa5df8a00.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RevisionFailures.RevisionSettingsDuplicateName Property

More than one Revisons have the same name %1!s!.

## Syntax (C#)
```csharp
public static FailureDefinitionId RevisionSettingsDuplicateName { get; }
```